SimulationsCode/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
  =========                 | 
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox 
   \    /   O peration     | Website:  https://openfoam.org 
    \  /    A nd           | Version:  6 
     \/     M anipulation  | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 1; 

vertices
(
    (0.0 0.0 0)
    (21.0 -10.0 0)
    (1.874885892508946 -10.0 0)
    (0.0 -10.0 0)
    (-10.0 0.0 0)
    (0.0 10.0 0)
    (1.874885892508946 10.0 0)
    (21.0 10.0 0)
    (21.0 -6.535514018691495 0)
    (21.0 -6.635514018691494 0)
    (21.0 -6.735514018691494 0)
    (1.0325512939396517 0.0945537585866072 0)
    (1.0 0.0 0)
    (0.9769817571145927 -0.09731474962444489 0)
    (0.23055836034186894 0.23562190918421044 0)
    (0.25 0.13753 0)
    (0.25 -0.0048 0)
    (0.26944163965813106 -0.10289190918421044 0)
    (-0.1 0.0 0)
    (0.0 0.0 1)
    (21.0 -10.0 1)
    (1.874885892508946 -10.0 1)
    (0.0 -10.0 1)
    (-10.0 0.0 1)
    (0.0 10.0 1)
    (1.874885892508946 10.0 1)
    (21.0 10.0 1)
    (21.0 -6.535514018691495 1)
    (21.0 -6.635514018691494 1)
    (21.0 -6.735514018691494 1)
    (1.0325512939396517 0.0945537585866072 1)
    (1.0 0.0 1)
    (0.9769817571145927 -0.09731474962444489 1)
    (0.23055836034186894 0.23562190918421044 1)
    (0.25 0.13753 1)
    (0.25 -0.0048 1)
    (0.26944163965813106 -0.10289190918421044 1)
    (-0.1 0.0 1)
);

blocks
(
    hex (2 1 10 13 21 20 29 32) (170 91 1) simpleGrading (10.611470019699073 61.63481519617197 61.63481519617197 10.611470019699073 0.012162813885540929 0.012162813885540929 0.012162813885540929 0.012162813885540929 1 1 1 1) 
    hex (3 2 13 17 22 21 32 36) (80 91 1) simpleGrading (0.8043442555552571 1.3790327566603644 1.3790327566603644 0.8043442555552571 0.01223797600757257 0.012162813885540929 0.012162813885540929 0.01223797600757257 1 1 1 1) 
    hex (4 3 17 18 23 22 36 37) (31 91 1) edgeGrading (0.0125 0.5 0.5 0.0125 0.012162813885540929 0.01223797600757257 0.01223797600757257 0.012162813885540929 1 1 1 1) 
    hex (4 18 14 5 23 37 33 24) (91 31 1) edgeGrading (0.012162813885540929 0.012453289365516668 0.012453289365516668 0.012162813885540929 0.0125 0.5 0.5 0.0125 1 1 1 1) 
    hex (14 11 6 5 33 30 25 24) (69 91 1) edgeGrading (1.7481344872365778 0.8043442555552571 0.8043442555552571 1.7481344872365778 80.30006937516556 82.21781648642946 82.21781648642946 80.30006937516556 1 1 1 1) 
    hex (11 8 7 6 30 27 26 25) (170 91 1) simpleGrading (61.63481519617197 10.611470019699073 10.611470019699073 61.63481519617197 82.21781648642946 82.21781648642946 82.21781648642946 82.21781648642946 1 1 1 1) 
    hex (12 9 8 11 31 28 27 30) (170 37 1) simpleGrading (61.63481519617197 6.081406942770463 1) 
    hex (15 12 11 14 34 31 30 33) (69 37 1) egeeGrading (0.8 1.7481344872365778 1.7481344872365778 0.8 6.081406942770463 6.081406942770463 6.081406942770463 6.081406942770463 1 1 1 1) 
    hex (0 15 14 18 19 34 33 37) (31 37 1) edgeGrading (2 0.5 0.5 2 6.081406942770463 6.081406942770463 6.081406942770463 6.081406942770463 1 1 1 1) 
    hex (18 17 16 0 37 36 35 19) (31 37 1) edgeGrading (0.5 2 2 0.5 0.16443563297285893 0.16443563297285893 0.16443563297285893 0.16443563297285893 1 1 1 1) 
    hex (17 13 12 16 36 32 31 35) (80 37 1) edgeGrading (1.3790327566603644 0.8 0.8 1.3790327566603644 0.16443563297285893 0.16443563297285893 0.16443563297285893 0.16443563297285893 1 1 1 1) 
    hex (13 10 9 12 32 29 28 31) (170 37 1) simpleGrading (61.63481519617197 0.16443563297285893 1) 
);

edges
(
    polyLine 11 14
    (
        (1.0314812939396516 0.09492375858660719 0)
        (1.0229581660661748 0.09785794846577087 0)
        (1.0060176600151942 0.10369500953167594 0)
        (0.9809800127633166 0.11230764151755898 0)
        (0.9482860711838079 0.12356211382658158 0)
        (0.9084764198560153 0.1372719937714634 0)
        (0.8860973985813577 0.1449750995218462 0)
        (0.8622258033071926 0.15319220606111414 0)
        (0.8369470526696704 0.16189833198111384 0)
        (0.8103397648877404 0.17106428496769896 0)
        (0.7812855780895691 0.18105006424298453 0)
        (0.7507430434264507 0.1906878507918372 0)
        (0.7195557727438124 0.200186802992749 0)
        (0.6873647629310364 0.20932493973826444 0)
        (0.654279996668586 0.21822805730916 0)
        (0.6202321644796605 0.2265536312831472 0)
        (0.5853651928795683 0.23426805847032367 0)
        (0.5500544280912765 0.2409526067162355 0)
        (0.514048873892808 0.24681822764974626 0)
        (0.477407336203214 0.2512378975296754 0)
        (0.43989888845520386 0.25430684069252796 0)
        (0.4022941155440372 0.2550998785001081 0)
        (0.3652312393776221 0.2541963151963463 0)
        (0.32930258552185204 0.2512110110518041 0)
        (0.29479328644981406 0.24716390457473186 0)
        (0.2610777574575052 0.24165625920214573 0)
    )
    polyLine 30 33
    (
        (1.0314812939396516 0.09492375858660719 1)
        (1.0229581660661748 0.09785794846577087 1)
        (1.0060176600151942 0.10369500953167594 1)
        (0.9809800127633166 0.11230764151755898 1)
        (0.9482860711838079 0.12356211382658158 1)
        (0.9084764198560153 0.1372719937714634 1)
        (0.8860973985813577 0.1449750995218462 1)
        (0.8622258033071926 0.15319220606111414 1)
        (0.8369470526696704 0.16189833198111384 1)
        (0.8103397648877404 0.17106428496769896 1)
        (0.7812855780895691 0.18105006424298453 1)
        (0.7507430434264507 0.1906878507918372 1)
        (0.7195557727438124 0.200186802992749 1)
        (0.6873647629310364 0.20932493973826444 1)
        (0.654279996668586 0.21822805730916 1)
        (0.6202321644796605 0.2265536312831472 1)
        (0.5853651928795683 0.23426805847032367 1)
        (0.5500544280912765 0.2409526067162355 1)
        (0.514048873892808 0.24681822764974626 1)
        (0.477407336203214 0.2512378975296754 1)
        (0.43989888845520386 0.25430684069252796 1)
        (0.4022941155440372 0.2550998785001081 1)
        (0.3652312393776221 0.2541963151963463 1)
        (0.32930258552185204 0.2512110110518041 1)
        (0.29479328644981406 0.24716390457473186 1)
        (0.2610777574575052 0.24165625920214573 1)
    )
    polyLine 14 18
    (
        (0.19704461438274867 0.22762173054215884 0)
        (0.1668919868302636 0.21917466087698728 0)
        (0.13796349877664657 0.20989717390917287 0)
        (0.11026860853546014 0.1997950337178256 0)
        (0.08405050938315278 0.18896863748962955 0)
        (0.05936742479866416 0.17755299890991683 0)
        (0.03611795125623908 0.1654934835100618 0)
        (0.01448447964307955 0.152876817189042 0)
        (-0.005459889591409493 0.13982066762347994 0)
        (-0.023903412125673026 0.1261790792259917 0)
        (-0.04056502706090802 0.11206023495374795 0)
        (-0.055936398507753046 0.0970399148810178 0)
        (-0.06885464166321659 0.0818443546515569 0)
        (-0.07941470341728739 0.06724838952401489 0)
        (-0.09355370555231952 0.03913740093961082 0)
        (-0.09878101028738615 0.015566374227909156 0)
    )
    polyLine 33 37
    (
        (0.19704461438274867 0.22762173054215884 1)
        (0.1668919868302636 0.21917466087698728 1)
        (0.13796349877664657 0.20989717390917287 1)
        (0.11026860853546014 0.1997950337178256 1)
        (0.08405050938315278 0.18896863748962955 1)
        (0.05936742479866416 0.17755299890991683 1)
        (0.03611795125623908 0.1654934835100618 1)
        (0.01448447964307955 0.152876817189042 1)
        (-0.005459889591409493 0.13982066762347994 1)
        (-0.023903412125673026 0.1261790792259917 1)
        (-0.04056502706090802 0.11206023495374795 1)
        (-0.055936398507753046 0.0970399148810178 1)
        (-0.06885464166321659 0.0818443546515569 1)
        (-0.07941470341728739 0.06724838952401489 1)
        (-0.09355370555231952 0.03913740093961082 1)
        (-0.09878101028738615 0.015566374227909156 1)
    )
    polyLine 18 17
    (
        (-0.08093685840099187 -0.06318652510156171 0)
        (-0.0562850113728731 -0.0901331072498979 0)
        (-0.015000853990781653 -0.10938422744517715 0)
        (0.006112917560233119 -0.11320120154884719 0)
        (0.021493583371545912 -0.11419309200953294 0)
        (0.035943015486736465 -0.1148375893716717 0)
        (0.05242412259238704 -0.11484626639102746 0)
        (0.06937391418427016 -0.11458158072753495 0)
        (0.08792843560677223 -0.11400305683762056 0)
        (0.10773668559707561 -0.11318241682930691 0)
        (0.129058747147924 -0.11218598348370364 0)
        (0.1519766753729786 -0.11097716250010167 0)
        (0.17615697480261114 -0.10958008747191267 0)
        (0.20169971174997925 -0.1080750144268745 0)
        (0.22855979333619658 -0.10638819700068532 0)
    )
    polyLine 37 36
    (
        (-0.08093685840099187 -0.06318652510156171 1)
        (-0.0562850113728731 -0.0901331072498979 1)
        (-0.015000853990781653 -0.10938422744517715 1)
        (0.006112917560233119 -0.11320120154884719 1)
        (0.021493583371545912 -0.11419309200953294 1)
        (0.035943015486736465 -0.1148375893716717 1)
        (0.05242412259238704 -0.11484626639102746 1)
        (0.06937391418427016 -0.11458158072753495 1)
        (0.08792843560677223 -0.11400305683762056 1)
        (0.10773668559707561 -0.11318241682930691 1)
        (0.129058747147924 -0.11218598348370364 1)
        (0.1519766753729786 -0.11097716250010167 1)
        (0.17615697480261114 -0.10958008747191267 1)
        (0.20169971174997925 -0.1080750144268745 1)
        (0.22855979333619658 -0.10638819700068532 1)
    )
    polyLine 17 13
    (
        (0.2857985728210412 -0.10252899060840134 0)
        (0.316054464278286 -0.1004462347531338 0)
        (0.3472474850373895 -0.09797209057889474 0)
        (0.3795767598712024 -0.09536537211646608 0)
        (0.4127917547322144 -0.09205380300922905 0)
        (0.4464552226133136 -0.08841139692462549 0)
        (0.4793326824571354 -0.08421343326835103 0)
        (0.5115431157000595 -0.0805215482610386 0)
        (0.5437866095159389 -0.0767235353035959 0)
        (0.5753546620336781 -0.07339918432887976 0)
        (0.6062618790166309 -0.07037979303331036 0)
        (0.6363427803813237 -0.06805939332305672 0)
        (0.6656067752797042 -0.06625052576636584 0)
        (0.6939706682088232 -0.06523539193528471 0)
        (0.7213786628047731 -0.06477971519992252 0)
        (0.7476881731939359 -0.06510327371262163 0)
        (0.7729409848028106 -0.06597236606937898 0)
        (0.7969602617567723 -0.06749435752814847 0)
        (0.8197937707081646 -0.06946110538515335 0)
        (0.841360498943325 -0.07190429997732753 0)
        (0.8609413461888634 -0.07450183587860663 0)
        (0.8983878795691064 -0.08055477475711859 0)
        (0.9284825692880767 -0.08638826949884758 0)
        (0.95195939674534 -0.09148906997110211 0)
        (0.9680690570184746 -0.09511705116803387 0)
        (0.9759117571145927 -0.09697474962444488 0)
    )
    polyLine 36 32
    (
        (0.2857985728210412 -0.10252899060840134 1)
        (0.316054464278286 -0.1004462347531338 1)
        (0.3472474850373895 -0.09797209057889474 1)
        (0.3795767598712024 -0.09536537211646608 1)
        (0.4127917547322144 -0.09205380300922905 1)
        (0.4464552226133136 -0.08841139692462549 1)
        (0.4793326824571354 -0.08421343326835103 1)
        (0.5115431157000595 -0.0805215482610386 1)
        (0.5437866095159389 -0.0767235353035959 1)
        (0.5753546620336781 -0.07339918432887976 1)
        (0.6062618790166309 -0.07037979303331036 1)
        (0.6363427803813237 -0.06805939332305672 1)
        (0.6656067752797042 -0.06625052576636584 1)
        (0.6939706682088232 -0.06523539193528471 1)
        (0.7213786628047731 -0.06477971519992252 1)
        (0.7476881731939359 -0.06510327371262163 1)
        (0.7729409848028106 -0.06597236606937898 1)
        (0.7969602617567723 -0.06749435752814847 1)
        (0.8197937707081646 -0.06946110538515335 1)
        (0.841360498943325 -0.07190429997732753 1)
        (0.8609413461888634 -0.07450183587860663 1)
        (0.8983878795691064 -0.08055477475711859 1)
        (0.9284825692880767 -0.08638826949884758 1)
        (0.95195939674534 -0.09148906997110211 1)
        (0.9680690570184746 -0.09511705116803387 1)
        (0.9759117571145927 -0.09697474962444488 1)
    )
    spline 12 15
    (
        (0.99893 0.00037 0)
        (0.99039 0.00331 0)
        (0.97347 0.00914 0)
        (0.94844 0.01775 0)
        (0.91573 0.02901 0)
        (0.87592 0.04272 0)
        (0.85355 0.05042 0)
        (0.82967 0.05864 0)
        (0.80438 0.06735 0)
        (0.77779 0.07651 0)
        (0.75 0.08607 0)
        (0.72114 0.09517 0)
        (0.69134 0.10425 0)
        (0.66072 0.11294 0)
        (0.62941 0.12137 0)
        (0.59755 0.12916 0)
        (0.56526 0.13631 0)
        (0.5327 0.14247 0)
        (0.5 0.14781 0)
        (0.4673 0.15175 0)
        (0.43474 0.15444 0)
        (0.40245 0.1551 0)
        (0.37059 0.15434 0)
        (0.33928 0.15171 0)
        (0.30866 0.14813 0)
        (0.27886 0.14325 0)
    )
    spline 31 34
    (
        (0.99893 0.00037 1)
        (0.99039 0.00331 1)
        (0.97347 0.00914 1)
        (0.94844 0.01775 1)
        (0.91573 0.02901 1)
        (0.87592 0.04272 1)
        (0.85355 0.05042 1)
        (0.82967 0.05864 1)
        (0.80438 0.06735 1)
        (0.77779 0.07651 1)
        (0.75 0.08607 1)
        (0.72114 0.09517 1)
        (0.69134 0.10425 1)
        (0.66072 0.11294 1)
        (0.62941 0.12137 1)
        (0.59755 0.12916 1)
        (0.56526 0.13631 1)
        (0.5327 0.14247 1)
        (0.5 0.14781 1)
        (0.4673 0.15175 1)
        (0.43474 0.15444 1)
        (0.40245 0.1551 1)
        (0.37059 0.15434 1)
        (0.33928 0.15171 1)
        (0.30866 0.14813 1)
        (0.27886 0.14325 1)
    )
    arc 4 5 (-7.071072502792263 7.071063120935576 0)
    arc 3 4 (-7.071072502792263 -7.071063120935576 0)
    arc 23 24 (-7.071072502792263 7.071063120935576 1)
    arc 22 23 (-7.071072502792263 -7.071063120935576 1)
    spline 15 0
    (
        (0.22221 0.13084 0)
        (0.19562 0.12339 0)
        (0.17033 0.11528 0)
        (0.14645 0.10657 0)
        (0.12408 0.09733 0)
        (0.10332 0.08773 0)
        (0.08427 0.07785 0)
        (0.06699 0.06777 0)
        (0.05156 0.05767 0)
        (0.03806 0.04769 0)
        (0.02653 0.03791 0)
        (0.01704 0.02867 0)
        (0.00961 0.01985 0)
        (0.00428 0.01252 0)
        (0.00107 0.00679 0)
        (0.0 0.0 0)
    )
    spline 34 19
    (
        (0.22221 0.13084 1)
        (0.19562 0.12339 1)
        (0.17033 0.11528 1)
        (0.14645 0.10657 1)
        (0.12408 0.09733 1)
        (0.10332 0.08773 1)
        (0.08427 0.07785 1)
        (0.06699 0.06777 1)
        (0.05156 0.05767 1)
        (0.03806 0.04769 1)
        (0.02653 0.03791 1)
        (0.01704 0.02867 1)
        (0.00961 0.01985 1)
        (0.00428 0.01252 1)
        (0.00107 0.00679 1)
        (0.0 0.0 1)
    )
    spline 0 16
    (
        (0.00107 -0.00596 0)
        (0.00428 -0.01056 0)
        (0.00961 -0.01246 0)
        (0.01704 -0.0138 0)
        (0.02653 -0.01432 0)
        (0.03806 -0.01486 0)
        (0.05156 -0.01485 0)
        (0.06699 -0.01461 0)
        (0.08427 -0.01407 0)
        (0.10332 -0.01328 0)
        (0.12408 -0.01231 0)
        (0.14645 -0.01113 0)
        (0.17033 -0.00975 0)
        (0.19562 -0.00826 0)
        (0.22221 -0.00659 0)
    )
    spline 19 35
    (
        (0.00107 -0.00596 1)
        (0.00428 -0.01056 1)
        (0.00961 -0.01246 1)
        (0.01704 -0.0138 1)
        (0.02653 -0.01432 1)
        (0.03806 -0.01486 1)
        (0.05156 -0.01485 1)
        (0.06699 -0.01461 1)
        (0.08427 -0.01407 1)
        (0.10332 -0.01328 1)
        (0.12408 -0.01231 1)
        (0.14645 -0.01113 1)
        (0.17033 -0.00975 1)
        (0.19562 -0.00826 1)
        (0.22221 -0.00659 1)
    )
    spline 16 12
    (
        (0.27886 -0.00277 0)
        (0.30866 -0.00072 0)
        (0.33928 0.00171 0)
        (0.37059 0.00423 0)
        (0.40245 0.00741 0)
        (0.43474 0.0109 0)
        (0.4673 0.01506 0)
        (0.5 0.01881 0)
        (0.5327 0.02266 0)
        (0.56526 0.02609 0)
        (0.59755 0.02924 0)
        (0.62941 0.0317 0)
        (0.66072 0.03363 0)
        (0.69134 0.03473 0)
        (0.72114 0.03522 0)
        (0.75 0.03487 0)
        (0.77779 0.03391 0)
        (0.80438 0.03223 0)
        (0.82967 0.03005 0)
        (0.85355 0.02735 0)
        (0.87592 0.02437 0)
        (0.91573 0.01793 0)
        (0.94844 0.0116 0)
        (0.97347 0.00617 0)
        (0.99039 0.00236 0)
        (0.99893 0.00034 0)
    )
    spline 35 31
    (
        (0.27886 -0.00277 1)
        (0.30866 -0.00072 1)
        (0.33928 0.00171 1)
        (0.37059 0.00423 1)
        (0.40245 0.00741 1)
        (0.43474 0.0109 1)
        (0.4673 0.01506 1)
        (0.5 0.01881 1)
        (0.5327 0.02266 1)
        (0.56526 0.02609 1)
        (0.59755 0.02924 1)
        (0.62941 0.0317 1)
        (0.66072 0.03363 1)
        (0.69134 0.03473 1)
        (0.72114 0.03522 1)
        (0.75 0.03487 1)
        (0.77779 0.03391 1)
        (0.80438 0.03223 1)
        (0.82967 0.03005 1)
        (0.85355 0.02735 1)
        (0.87592 0.02437 1)
        (0.91573 0.01793 1)
        (0.94844 0.0116 1)
        (0.97347 0.00617 1)
        (0.99039 0.00236 1)
        (0.99893 0.00034 1)
    )
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
          (1 2 13 10)
          (2 3 17 13)
          (3 4 18 17)
          (18 4 5 14)
          (11 14 5 6)
          (8 11 6 7)
          (9 12 11 8)
          (12 15 14 11)
          (0 18 14 15)
          (17 18 0 16)
          (13 17 16 12)
          (10 13 12 9)
          (21 20 29 32)
          (22 21 32 36)
          (23 22 36 37)
          (23 37 33 24)
          (33 30 25 24)
          (30 27 26 25)
          (31 28 27 30)
          (34 31 30 33)
          (37 19 34 33)
          (37 36 35 19)
          (36 32 31 35)
          (32 29 28 31)
         );
     }
    farfield
    {
        type patch;
        faces
        (
          (4 23 24 5)
          (5 24 25 6)
          (6 25 26 7)
          (27 8 7 26)
          (28 9 8 27)
          (29 10 9 28)
          (20 1 10 29)
          (21 2 1 20)
          (22 3 2 21)
          (23 4 3 22)
         );
     }
    airfoil
    {
        type wall;
        faces
        (
          (34 15 12 31)
          (19 0 15 34)
          (0 19 35 16)
          (16 35 31 12)
         );
     }
);
